# GetBodyRowHeights Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleHeightsOnSheet..::..GetBodyRowHeights Method
ScheduleHeightsOnSheet Class See Also
---
Returns each row's height of schedule body on sheet view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public IList<double> GetBodyRowHeights()
```

Visual Basic
---
```text
Public Function GetBodyRowHeights As IList(Of Double)
```

Visual C++
---
```text
public:
IList<double>^ GetBodyRowHeights()
```

# ### Return Value
Each row's height of schedule body on sheet view.
# See Also
ScheduleHeightsOnSheet Class
Autodesk.Revit.DB Namespace